In [2]:
import numpy as np
import pandas as pd

Series : A one-dimensional labeled array holding data of any type
DataFrame: A two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns

In [3]:
s= pd.Series([1,3,5,np.nan,6,9])

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))

In [6]:
df

                   A         B         C         D
2013-01-01 -0.932350 -1.516858 -0.767804  0.857554
2013-01-02  0.197324 -0.615708  0.165884 -0.345780
2013-01-03  1.479831 -0.920187 -1.936188 -0.771645
2013-01-04 -2.888471 -0.192728  0.110544  0.390994
2013-01-05 -0.113759 -0.140094  0.816357 -0.748742
2013-01-06  1.064922  0.951722 -1.186174 -0.685211

In [7]:
df2 = pd.DataFrame(
    {
        "A":5.00,
        "B":pd.Timestamp("20130102"), 
        "C":pd.Series(1,index=list(range(4)), dtype = "float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"Hi"
    }
)
df2

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [8]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [9]:
df2.head()

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [10]:
df.tail(2)

                   A         B         C         D
2013-01-05 -0.113759 -0.140094  0.816357 -0.748742
2013-01-06  1.064922  0.951722 -1.186174 -0.685211

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.to_numpy()

array([[-0.93235045, -1.51685761, -0.76780406,  0.85755381],
       [ 0.19732432, -0.61570786,  0.16588363, -0.34577975],
       [ 1.479831  , -0.92018721, -1.93618779, -0.77164523],
       [-2.88847114, -0.19272814,  0.11054371,  0.39099424],
       [-0.11375948, -0.14009352,  0.81635726, -0.748742  ],
       [ 1.06492211,  0.95172219, -1.18617395, -0.6852108 ]])

In [13]:
df2.to_numpy()

array([[5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi']],
      dtype=object)

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.932350    0.197324    1.479831   -2.888471   -0.113759    1.064922
B   -1.516858   -0.615708   -0.920187   -0.192728   -0.140094    0.951722
C   -0.767804    0.165884   -1.936188    0.110544    0.816357   -1.186174
D    0.857554   -0.345780   -0.771645    0.390994   -0.748742   -0.685211

In [15]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01 -0.932350 -1.516858 -0.767804  0.857554
2013-01-03  1.479831 -0.920187 -1.936188 -0.771645
2013-01-02  0.197324 -0.615708  0.165884 -0.345780
2013-01-04 -2.888471 -0.192728  0.110544  0.390994
2013-01-05 -0.113759 -0.140094  0.816357 -0.748742
2013-01-06  1.064922  0.951722 -1.186174 -0.685211

In [16]:
df["A"]

2013-01-01   -0.932350
2013-01-02    0.197324
2013-01-03    1.479831
2013-01-04   -2.888471
2013-01-05   -0.113759
2013-01-06    1.064922
Freq: D, Name: A, dtype: float64

In [17]:
df[0:1]

                  A         B         C         D
2013-01-01 -0.93235 -1.516858 -0.767804  0.857554

In [18]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.932350 -1.516858
2013-01-02  0.197324 -0.615708
2013-01-03  1.479831 -0.920187
2013-01-04 -2.888471 -0.192728
2013-01-05 -0.113759 -0.140094
2013-01-06  1.064922  0.951722

In [19]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [20]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.loc["20130102":"20130103"]
print(df)

                   A         B         C         D
2013-01-01 -0.932350 -1.516858 -0.767804  0.857554
2013-01-02  0.197324 -0.615708  0.165884 -0.345780
2013-01-03  1.479831 -0.920187 -1.936188 -0.771645
2013-01-04 -2.888471 -0.192728  0.110544  0.390994
2013-01-05 -0.113759 -0.140094  0.816357 -0.748742
2013-01-06  1.064922  0.951722 -1.186174 -0.685211

Selection by Location of Label

In [22]:
df.loc[dates[0],"A"]

np.float64(-0.9323504457453111)

In [23]:
df.at[dates[0],"A"]

np.float64(-0.9323504457453111)

Selection by Position || .iloc means selecting by integer based location ,, not by actual index

In [24]:
df.iloc[3]

A   -2.888471
B   -0.192728
C    0.110544
D    0.390994
Name: 2013-01-04 00:00:00, dtype: float64

In [25]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -2.888471 -0.192728
2013-01-05 -0.113759 -0.140094

In [26]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.197324  0.165884
2013-01-03  1.479831 -1.936188
2013-01-05 -0.113759  0.816357

In [27]:
df.iloc[1:3,]

                   A         B         C         D
2013-01-02  0.197324 -0.615708  0.165884 -0.345780
2013-01-03  1.479831 -0.920187 -1.936188 -0.771645

In [28]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.516858 -0.767804
2013-01-02 -0.615708  0.165884
2013-01-03 -0.920187 -1.936188
2013-01-04 -0.192728  0.110544
2013-01-05 -0.140094  0.816357
2013-01-06  0.951722 -1.186174

In [29]:
df.iloc[1,1]

np.float64(-0.6157078628201488)

In [30]:
df

                   A         B         C         D
2013-01-01 -0.932350 -1.516858 -0.767804  0.857554
2013-01-02  0.197324 -0.615708  0.165884 -0.345780
2013-01-03  1.479831 -0.920187 -1.936188 -0.771645
2013-01-04 -2.888471 -0.192728  0.110544  0.390994
2013-01-05 -0.113759 -0.140094  0.816357 -0.748742
2013-01-06  1.064922  0.951722 -1.186174 -0.685211

Boolean Indexing

In [31]:
df[df["A"]>0]

                   A         B         C         D
2013-01-02  0.197324 -0.615708  0.165884 -0.345780
2013-01-03  1.479831 -0.920187 -1.936188 -0.771645
2013-01-06  1.064922  0.951722 -1.186174 -0.685211

In [32]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN  0.857554
2013-01-02  0.197324       NaN  0.165884       NaN
2013-01-03  1.479831       NaN       NaN       NaN
2013-01-04       NaN       NaN  0.110544  0.390994
2013-01-05       NaN       NaN  0.816357       NaN
2013-01-06  1.064922  0.951722       NaN       NaN

In [33]:
df2 = df.copy()

In [34]:
df2["E"] = ["one","one","two","three","four","three"]

In [35]:
df2

                   A         B         C         D      E
2013-01-01 -0.932350 -1.516858 -0.767804  0.857554    one
2013-01-02  0.197324 -0.615708  0.165884 -0.345780    one
2013-01-03  1.479831 -0.920187 -1.936188 -0.771645    two
2013-01-04 -2.888471 -0.192728  0.110544  0.390994  three
2013-01-05 -0.113759 -0.140094  0.816357 -0.748742   four
2013-01-06  1.064922  0.951722 -1.186174 -0.685211  three

Setting

In [36]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range("20130102",periods=6))

In [37]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [38]:
df["F"]=s1

In [39]:
df.at[dates[0],"A"]=0

In [40]:
df.iat[0,1]=0

df.at(row_label, column_label) is used with labels... df.iat(row_index, column_index) is used with row and column integer index starting from

In [41]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.767804  0.857554  NaN
2013-01-02  0.197324 -0.615708  0.165884 -0.345780  1.0
2013-01-03  1.479831 -0.920187 -1.936188 -0.771645  2.0
2013-01-04 -2.888471 -0.192728  0.110544  0.390994  3.0
2013-01-05 -0.113759 -0.140094  0.816357 -0.748742  4.0
2013-01-06  1.064922  0.951722 -1.186174 -0.685211  5.0

In [42]:
df.loc[:,"D"]=np.array([5]*len(df))

In [43]:
len(df)

6

In [44]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.767804  5.0  NaN
2013-01-02  0.197324 -0.615708  0.165884  5.0  1.0
2013-01-03  1.479831 -0.920187 -1.936188  5.0  2.0
2013-01-04 -2.888471 -0.192728  0.110544  5.0  3.0
2013-01-05 -0.113759 -0.140094  0.816357  5.0  4.0
2013-01-06  1.064922  0.951722 -1.186174  5.0  5.0

In [45]:
df2 = df.copy()

In [46]:
df2[df2>0]= -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.767804 -5.0  NaN
2013-01-02 -0.197324 -0.615708 -0.165884 -5.0 -1.0
2013-01-03 -1.479831 -0.920187 -1.936188 -5.0 -2.0
2013-01-04 -2.888471 -0.192728 -0.110544 -5.0 -3.0
2013-01-05 -0.113759 -0.140094 -0.816357 -5.0 -4.0
2013-01-06 -1.064922 -0.951722 -1.186174 -5.0 -5.0

Missing Data

In [47]:
df1 = df.reindex(index=dates[0:4], columns =list(df.columns)+["E"])
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000 -0.767804  5.0  NaN NaN
2013-01-02  0.197324 -0.615708  0.165884  5.0  1.0 NaN
2013-01-03  1.479831 -0.920187 -1.936188  5.0  2.0 NaN
2013-01-04 -2.888471 -0.192728  0.110544  5.0  3.0 NaN

In [48]:
df1.loc[dates[0]: dates[1],"E"]=1

In [49]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.767804  5.0  NaN  1.0
2013-01-02  0.197324 -0.615708  0.165884  5.0  1.0  1.0
2013-01-03  1.479831 -0.920187 -1.936188  5.0  2.0  NaN
2013-01-04 -2.888471 -0.192728  0.110544  5.0  3.0  NaN

Drop Missing Values

In [50]:
df1.dropna(how="any", axis=1)
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.767804  5.0  NaN  1.0
2013-01-02  0.197324 -0.615708  0.165884  5.0  1.0  1.0
2013-01-03  1.479831 -0.920187 -1.936188  5.0  2.0  NaN
2013-01-04 -2.888471 -0.192728  0.110544  5.0  3.0  NaN

In [51]:
p=df1.dropna(how="all", axis=1)

In [52]:
p

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.767804  5.0  NaN  1.0
2013-01-02  0.197324 -0.615708  0.165884  5.0  1.0  1.0
2013-01-03  1.479831 -0.920187 -1.936188  5.0  2.0  NaN
2013-01-04 -2.888471 -0.192728  0.110544  5.0  3.0  NaN

In [53]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.767804  5.0  NaN
2013-01-02  0.197324 -0.615708  0.165884  5.0  1.0
2013-01-03  1.479831 -0.920187 -1.936188  5.0  2.0
2013-01-04 -2.888471 -0.192728  0.110544  5.0  3.0
2013-01-05 -0.113759 -0.140094  0.816357  5.0  4.0
2013-01-06  1.064922  0.951722 -1.186174  5.0  5.0

In [54]:
df3 = df.copy()

In [55]:
df3

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.767804  5.0  NaN
2013-01-02  0.197324 -0.615708  0.165884  5.0  1.0
2013-01-03  1.479831 -0.920187 -1.936188  5.0  2.0
2013-01-04 -2.888471 -0.192728  0.110544  5.0  3.0
2013-01-05 -0.113759 -0.140094  0.816357  5.0  4.0
2013-01-06  1.064922  0.951722 -1.186174  5.0  5.0

While using df.dropna function ,,, axis= 0 to remove row , 1 to remove column ... how="any" removes row/column if there is any missing value in the row/column .............. how = "all" removes the row./column only if all the value in the row or column are NaN

In [56]:
df5 = df3.dropna(axis=1, how="any")
df5

                   A         B         C    D
2013-01-01  0.000000  0.000000 -0.767804  5.0
2013-01-02  0.197324 -0.615708  0.165884  5.0
2013-01-03  1.479831 -0.920187 -1.936188  5.0
2013-01-04 -2.888471 -0.192728  0.110544  5.0
2013-01-05 -0.113759 -0.140094  0.816357  5.0
2013-01-06  1.064922  0.951722 -1.186174  5.0

Operations

In [57]:
df.rename(columns={"F":"E"},inplace=True)
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000 -0.767804  5.0  NaN
2013-01-02  0.197324 -0.615708  0.165884  5.0  1.0
2013-01-03  1.479831 -0.920187 -1.936188  5.0  2.0
2013-01-04 -2.888471 -0.192728  0.110544  5.0  3.0
2013-01-05 -0.113759 -0.140094  0.816357  5.0  4.0
2013-01-06  1.064922  0.951722 -1.186174  5.0  5.0

In [58]:
df.mean()

A   -0.043359
B   -0.152832
C   -0.466230
D    5.000000
E    3.000000
dtype: float64

In [59]:
df.mean(axis=0)

A   -0.043359
B   -0.152832
C   -0.466230
D    5.000000
E    3.000000
dtype: float64

In [60]:
df.mean(axis=1)

2013-01-01    1.058049
2013-01-02    1.149500
2013-01-03    1.124691
2013-01-04    1.005869
2013-01-05    1.912501
2013-01-06    2.166094
Freq: D, dtype: float64

In [61]:
s= pd.Series([1,2,5,np.nan,6,8],index=dates).shift(2)

In [62]:
df,s

(                   A         B         C    D    E
 2013-01-01  0.000000  0.000000 -0.767804  5.0  NaN
 2013-01-02  0.197324 -0.615708  0.165884  5.0  1.0
 2013-01-03  1.479831 -0.920187 -1.936188  5.0  2.0
 2013-01-04 -2.888471 -0.192728  0.110544  5.0  3.0
 2013-01-05 -0.113759 -0.140094  0.816357  5.0  4.0
 2013-01-06  1.064922  0.951722 -1.186174  5.0  5.0,
 2013-01-01    NaN
 2013-01-02    NaN
 2013-01-03    1.0
 2013-01-04    2.0
 2013-01-05    5.0
 2013-01-06    NaN
 Freq: D, dtype: float64)

In [63]:
df.sub(s,axis="index")

                   A         B         C    D    E
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.479831 -1.920187 -2.936188  4.0  1.0
2013-01-04 -4.888471 -2.192728 -1.889456  3.0  1.0
2013-01-05 -5.113759 -5.140094 -4.183643  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

User Defined Functions

.agg() is used to perform a column wise operation in the dataframe,, where each column as pandas series is operated.. to operate in row, we can use axis=1

In [64]:
df.agg(lambda x: np.mean(x)*2)

A    -0.086718
B    -0.305665
C    -0.932460
D    10.000000
E     6.000000
dtype: float64

In [65]:
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000 -0.767804  5.0  NaN
2013-01-02  0.197324 -0.615708  0.165884  5.0  1.0
2013-01-03  1.479831 -0.920187 -1.936188  5.0  2.0
2013-01-04 -2.888471 -0.192728  0.110544  5.0  3.0
2013-01-05 -0.113759 -0.140094  0.816357  5.0  4.0
2013-01-06  1.064922  0.951722 -1.186174  5.0  5.0

df.transform() applies a function to each element preserving the shape of the dataframe

In [66]:
df.transform(lambda x:x*100)

                     A          B           C      D      E
2013-01-01    0.000000   0.000000  -76.780406  500.0    NaN
2013-01-02   19.732432 -61.570786   16.588363  500.0  100.0
2013-01-03  147.983100 -92.018721 -193.618779  500.0  200.0
2013-01-04 -288.847114 -19.272814   11.054371  500.0  300.0
2013-01-05  -11.375948 -14.009352   81.635726  500.0  400.0
2013-01-06  106.492211  95.172219 -118.617395  500.0  500.0

Value Counts

In [67]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    4
1    1
2    6
3    2
4    6
5    0
6    4
7    1
8    4
9    5
dtype: int32

In [68]:
s.value_counts()

4    3
1    2
6    2
2    1
0    1
5    1
Name: count, dtype: int64

String Methods

In [69]:
s=pd.Series(["A","B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])

In [70]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [71]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [72]:
df = pd.DataFrame(np.random.randn(10,4))

In [73]:
df

          0         1         2         3
0 -0.679125  1.037345 -1.853669  0.422673
1  1.223857  1.546795 -0.555599  1.160211
2  2.298077 -0.345947 -0.059559 -1.440379
3 -1.897805  0.293846  0.201212  0.729540
4  0.500823  0.416233  0.759579 -0.124914
5 -1.165019 -0.130907  0.950145 -2.780455
6  1.351975 -0.136432 -1.380962  1.449208
7  1.290999  0.262006 -0.738171  1.212053
8  1.100445  0.503965  1.079149  0.021103
9 -0.465793 -1.031788  1.511771  1.409295

Breaking into Pieces

In [74]:
pieces = [df[:3],df[3:7],df[7:]]

In [75]:
pieces

[          0         1         2         3
 0 -0.679125  1.037345 -1.853669  0.422673
 1  1.223857  1.546795 -0.555599  1.160211
 2  2.298077 -0.345947 -0.059559 -1.440379,
           0         1         2         3
 3 -1.897805  0.293846  0.201212  0.729540
 4  0.500823  0.416233  0.759579 -0.124914
 5 -1.165019 -0.130907  0.950145 -2.780455
 6  1.351975 -0.136432 -1.380962  1.449208,
           0         1         2         3
 7  1.290999  0.262006 -0.738171  1.212053
 8  1.100445  0.503965  1.079149  0.021103
 9 -0.465793 -1.031788  1.511771  1.409295]

In [76]:
pd.concat(pieces)

          0         1         2         3
0 -0.679125  1.037345 -1.853669  0.422673
1  1.223857  1.546795 -0.555599  1.160211
2  2.298077 -0.345947 -0.059559 -1.440379
3 -1.897805  0.293846  0.201212  0.729540
4  0.500823  0.416233  0.759579 -0.124914
5 -1.165019 -0.130907  0.950145 -2.780455
6  1.351975 -0.136432 -1.380962  1.449208
7  1.290999  0.262006 -0.738171  1.212053
8  1.100445  0.503965  1.079149  0.021103
9 -0.465793 -1.031788  1.511771  1.409295

https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=records%20to%20it.-,Join,-%23

Join

In [77]:
left = pd.DataFrame({"key":["foo","foo"],"Ival":[1,2]})
left

   key  Ival
0  foo     1
1  foo     2

In [78]:
right = pd.DataFrame({"key":["foo","foo"],"rval":[4,5]})
right

   key  rval
0  foo     4
1  foo     5

In [79]:
pd.merge(left,right,on="key")

   key  Ival  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [80]:
left = pd.DataFrame({"key":["foo","zoo"],"Ival":[1,2]})
right = pd.DataFrame({"key":["foo","zoo"],"Jval":[4,5]})
pd.merge(left,right,on="key")

   key  Ival  Jval
0  foo     1     4
1  zoo     2     5

Grouping

In [81]:
df = pd.DataFrame(
    {
        "A":["foo","bar","foo","bar","foo","bar","foo","bar"],
        "B":["one","one","two","three","two","two","one","one"],
        "C":np.random.randn(8),
        "D":np.random.randn(8)
    }
)

In [82]:
df

     A      B         C         D
0  foo    one  0.621178 -0.816785
1  bar    one  0.611387  0.965083
2  foo    two  1.476068  1.058686
3  bar  three -1.731414 -2.328804
4  foo    two  1.408124 -0.008929
5  bar    two  0.868436  2.026670
6  foo    one -0.953274 -0.788969
7  bar    one -1.651454  0.577641

[2082/05/07 09:55 PM](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=a%20column%20label%2C%20selecting)

In [83]:
df.groupby("A")[["C","D"]].sum()

            C         D
A
bar -1.903045  1.240590
foo  2.552096 -0.555997

2081/05/08    08:09 PM ...... August 24, 2025

In [ ]:
df.groupby("A")[["C"]].sum()